---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlanViewTopClipHeight
source: html/8e3b592a-cfed-3510-8d98-03984d7aad84.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlanViewTopClipHeight Property

"Top Clip Height"

## Syntax (C#)
```csharp
public static ForgeTypeId PlanViewTopClipHeight { get; }
```